RT-Thread/rt-thread/bsp/nxp/lpc/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_power.h
    /*
       This enum member has no practical meaning,it is used to avoid MISRA issue,
       user should not trying to use it.
       */
    kPDRUNCFG_ForceUnsigned = 0x80000000U,
} pd_bit_t;

/**
 * @brief SRAM instances bit masks
 */
typedef enum _power_sram_bit
{
    kPOWER_SRAM_RAM_X0        = (1UL << 0),  /*!< RAM_X0 */
    kPOWER_SRAM_RAM_00        = (1UL << 1),  /*!< RAM_00 */
    kPOWER_SRAM_RAM_01        = (1UL << 2),  /*!< RAM_01 */
    kPOWER_SRAM_RAM_02        = (1UL << 3),  /*!< RAM_02 */
    kPOWER_SRAM_RAM_03        = (1UL << 4),  /*!< RAM_03 */
    kPOWER_SRAM_RAM_10        = (1UL << 5),  /*!< RAM_10 */
    kPOWER_SRAM_RAM_20        = (1UL << 6),  /*!< RAM_20 */
    kPOWER_SRAM_RAM_30        = (1UL << 7),  /*!< RAM_30 */
    kPOWER_SRAM_RAM_40        = (1UL << 8),  /*!< RAM_40 */
    kPOWER_SRAM_RAM_41        = (1UL << 9),  /*!< RAM_41 */
    kPOWER_SRAM_RAM_42        = (1UL << 10), /*!< RAM_42 */
    kPOWER_SRAM_RAM_43        = (1UL << 11), /*!< RAM_43 */
    kPOWER_SRAM_FLASHCACHE    = (1UL << 12), /*!< Reserved. Flash Cache SRAM instance */
    kPOWER_SRAM_FLEXSPICACHE  = (1UL << 13), /*!< Reserved. FlexSPI Cache SRAM instance */
    kPOWER_SRAM_FLEXSPIH2PREG = (1UL << 14), /*!< Reserved. FlexSPI Dual Port Register Files instances */

    kPOWER_SRAM_DSLP_MASK = 0x7FFFUL, /*!< Reserved. DEEP-SLEEP SRAM instances */
    kPOWER_SRAM_PDWN_MASK = 0xFFFUL,  /*!< Reserved. POWER-DOWN SRAM instances */

#if (defined(LPC55S36_SERIES) || defined(LPC5536_SERIES) || defined(LPC5534_SERIES))
    kPOWER_SRAM_DPWD_MASK = 0xFE6UL, /*!< Reserved. DEEP-POWER-DOWN SRAM instances (RAM_X0, RAM_02 and RAM_03 excluded:
                                        they are used by ROM Boot code) */
#else
    kPOWER_SRAM_DPWD_MASK = 0xF3FUL, /*!< Reserved. DEEP-POWER-DOWN SRAM instances (RAM_20 & RAM_30 excluded).*/
#endif

    /*
       This enum member has no practical meaning,it is used to avoid MISRA issue,
       user should not trying to use it.
       */
    kPOWER_SRAM_ForceUnsigned = 0x80000000U,
} power_sram_bit_t;

/**
 * @brief SRAM instances indexes
 */
typedef enum _power_sram_index
{
    kPOWER_SRAM_IDX_RAM_X0        = 0UL,  /*!< RAM_X0 */
    kPOWER_SRAM_IDX_RAM_00        = 1UL,  /*!< RAM_00 */
    kPOWER_SRAM_IDX_RAM_01        = 2UL,  /*!< RAM_01 */
    kPOWER_SRAM_IDX_RAM_02        = 3UL,  /*!< RAM_02 */
    kPOWER_SRAM_IDX_RAM_03        = 4UL,  /*!< RAM_03 */
    kPOWER_SRAM_IDX_RAM_10        = 5UL,  /*!< RAM_10 */
    kPOWER_SRAM_IDX_RAM_20        = 6UL,  /*!< RAM_20 */
    kPOWER_SRAM_IDX_RAM_30        = 7UL,  /*!< RAM_30 */
    kPOWER_SRAM_IDX_RAM_40        = 8UL,  /*!< RAM_40 */
    kPOWER_SRAM_IDX_RAM_41        = 9UL,  /*!< RAM_41 */
    kPOWER_SRAM_IDX_RAM_42        = 10UL, /*!< RAM_42 */
    kPOWER_SRAM_IDX_RAM_43        = 11UL, /*!< RAM_43 */
    kPOWER_SRAM_IDX_FLASHCACHE    = 12UL, /*!< Reserved. Flash Cache SRAM instance */
    kPOWER_SRAM_IDX_FLEXSPICACHE  = 13UL, /*!< Reserved. FlexSPI Cache SRAM instance */
    kPOWER_SRAM_IDX_FLEXSPIH2PREG = 14UL, /*!< Reserved. FlexSPI Dual Port Register Files instances */
} power_sram_index_t;

/*@brief SRAM Power Mode */
typedef enum _power_sram_pwr_mode
{
    kPOWER_SRAMPwrActive     = 0U, /*!< Active */
    kPOWER_SRAMPwrLightSleep = 1U, /*!< RESERVED, DO NOT USE (Light Sleep) */
    kPOWER_SRAMPwrDeepSleep  = 2U, /*!< Deep Sleep : SRAM content retained */
    kPOWER_SRAMPwrShutDown   = 3U, /*!< Shutdown: SRAM content lost */
} power_sram_pwr_mode_t;

/*@brief BOD VDDMAIN level */
typedef enum _power_bod_vddmain_level
{
    kPOWER_BodVddmainLevel1000mv = 0,  /*!< VDDMAIN Brown out detector level 1V */
    kPOWER_BodVddmainLevel1100mv = 1,  /*!< VDDMAIN Brown out detector level 1.1V */
    kPOWER_BodVddmainLevel1200mv = 2,  /*!< VDDMAIN Brown out detector level 1.2V */
    kPOWER_BodVddmainLevel1300mv = 3,  /*!< VDDMAIN Brown out detector level 1.3V */
    kPOWER_BodVddmainLevel1400mv = 4,  /*!< VDDMAIN Brown out detector level 1.4V */
    kPOWER_BodVddmainLevel1500mv = 5,  /*!< VDDMAIN Brown out detector level 1.5V */
    kPOWER_BodVddmainLevel1600mv = 6,  /*!< VDDMAIN Brown out detector level 1.6V */
    kPOWER_BodVddmainLevel1650mv = 7,  /*!< VDDMAIN Brown out detector level 1.65V */
    kPOWER_BodVddmainLevel1700mv = 8,  /*!< VDDMAIN Brown out detector level 1.7V */
    kPOWER_BodVddmainLevel1750mv = 9,  /*!< VDDMAIN Brown out detector level 1.75V */
    kPOWER_BodVddmainLevel1800mv = 10, /*!< VDDMAIN Brown out detector level 1.8V */
    kPOWER_BodVddmainLevel1900mv = 11, /*!< VDDMAIN Brown out detector level 1.9V */
    kPOWER_BodVddmainLevel2000mv = 12, /*!< VDDMAIN Brown out detector level 2V */
    kPOWER_BodVddmainLevel2100mv = 13, /*!< VDDMAIN Brown out detector level 2.1V */
    kPOWER_BodVddmainLevel2200mv = 14, /*!< VDDMAIN Brown out detector level 2.2V */
    kPOWER_BodVddmainLevel2300mv = 15, /*!< VDDMAIN Brown out detector level 2.3V */
    kPOWER_BodVddmainLevel2400mv = 16, /*!< VDDMAIN Brown out detector level 2.4V */
    kPOWER_BodVddmainLevel2500mv = 17, /*!< VDDMAIN Brown out detector level 2.5V */
    kPOWER_BodVddmainLevel2600mv = 18, /*!< VDDMAIN Brown out detector level 2.6V */
    kPOWER_BodVddmainLevel2700mv = 19, /*!< VDDMAIN Brown out detector level 2.7V */
    kPOWER_BodVddmainLevel2800mv = 20, /*!< VDDMAIN Brown out detector level 2.80 V */
    kPOWER_BodVddmainLevel2900mv = 21, /*!< VDDMAIN Brown out detector level 2.9V */
    kPOWER_BodVddmainLevel3000mv = 22, /*!< VDDMAIN Brown out detector level 3.0V */
    kPOWER_BodVddmainLevel3100mv = 23, /*!< VDDMAIN Brown out detector level 3.1V */
    kPOWER_BodVddmainLevel3200mv = 24, /*!< VDDMAIN Brown out detector level 3.2V */
    kPOWER_BodVddmainLevel3300mv = 25, /*!< VDDMAIN Brown out detector level 3.3V */
} power_bod_vddmain_level_t;

/*@brief BOD core level */
typedef enum _power_bod_core_level
{
    kPOWER_BodCoreLevel600mv = 0, /*!< core Brown out detector level 600mV */
    kPOWER_BodCoreLevel650mv = 1, /*!< core Brown out detector level 650mV */
    kPOWER_BodCoreLevel700mv = 2, /*!< core Brown out detector level 700mV */
    kPOWER_BodCoreLevel750mv = 3, /*!< core Brown out detector level 750mV */
    kPOWER_BodCoreLevel800mv = 4, /*!< core Brown out detector level 800mV */
    kPOWER_BodCoreLevel850mv = 5, /*!< core Brown out detector level 850mV */
    kPOWER_BodCoreLevel900mv = 6, /*!< core Brown out detector level 900mV */
    kPOWER_BodCoreLevel950mv = 7, /*!< core Brown out detector level 950mV */
} power_bod_core_level_t;

/*@brief BODs (VDDMAIN & Core) Hysteresis control */
typedef enum _power_bod_hyst
{
    kPOWER_BodHystLevel25mv  = 0U, /*!< BOD Hysteresis control level 25mv */
    kPOWER_BodHystLevel50mv  = 1U, /*!< BOD Hysteresis control level 50mv */
    kPOWER_BodHystLevel75mv  = 2U, /*!< BOD Hysteresis control level 75mv */
    kPOWER_BodHystLevel100mv = 3U, /*!< BOD Hysteresis control level 100mv */
} power_bod_hyst_t;

/*@brief Core Power Source */
typedef enum _power_core_pwr_source
{
    kPOWER_CoreSrcDCDC      = 0U, /*!< DCDC */
    kPOWER_CoreSrcLDOCoreHP = 1U, /*!< LDO Core High Power Mode */
    kPOWER_CoreSrcLDOCoreLP = 2U, /*!< LDO Core Low Power Mode (DO NOT USE : Reserved for test purposes) */
    kPOWER_CoreSrcExternal  = 3U, /*!< External (DO NOT USE : Reserved for test purposes) */
} power_core_pwr_source_t;

/*@brief Core Regulators Power State */
typedef enum _power_core_pwr_state
{
    kPOWER_CorePwrDisable = 0U, /*!< Disable */
    kPOWER_CorePwrEnable  = 1U, /*!< Enable */
} power_core_pwr_state_t;

